# Дано текст:
# “Любіть Україну, як сонце любіть,
# як вітер, і трави, і води...
# В годину щасливу і в радості мить,
# любіть у годину негоди.
# Любіть Україну у сні й наяву,
# вишневу свою Україну,
# красу її, вічно живу і нову,
# і мову її солов'їну.
# Без неї — ніщо ми, як порох і дим,
# розвіяний в полі вітрами...
# Любіть Україну всім серцем своїм
# і всіми своїми ділами.”
#
# Створіть з цього тексту словник де ключем обо значенням буде слово (як вам зручніше) з тексту.
# А значенням або ключем буде ціле число що характеризує скількі разів слово зустрілось у тексті.
# (Памятайте що у текстіі є розділові знаки - їх потрібно позбутися спочатку.)
#
# Виведіть 2 значення:
#  - яке слово і скільки разів зусрічається найбільше?
#  - яке слово і скільки разів зусрічається найменше? (опціонально)



poem = """Любіть Україну, як сонце любіть,
як вітер, і трави, і води...
В годину щасливу і в радості мить,
любіть у годину негоди.
Любіть Україну у сні й наяву,
вишневу свою Україну,
красу її, вічно живу і нову,
і мову її солов'їну.
Без неї — ніщо ми, як порох і дим,
розвіяний в полі вітрами...
Любіть Україну всім серцем своїм
і всіми своїми ділами."""

poem = poem.lower()
poem = poem.replace('\n', ' ')
delete_chars = ",;-.—"

for char in delete_chars:
    poem = poem.replace(char, "")

poem = poem.split(' ')
# print(poem)

count_element = [poem.count(i) for i in poem]
# print(count_element)

poem_dict = dict(zip(poem, count_element))
print(f' Ми отримали словник: {poem_dict} \n')

# зназодимо мінімальне і максимальне значення повторення слів
max_value = max(count_element)
min_value = min(count_element)
# print(min_value, max_value)

print('Перелік слів, які зустрічаються найбільше/найменше у даному вірші:')

for key, value in poem_dict.items():
    if value == max_value:
        print(key, '=', value)
    if value == min_value:
        print(key, '=', value)
