#   написати анонімну функцію яка приймає 2 значення x,y де y по замовчуванням == числу .
#   Результат роботи функції – число x у ступені y.
#   Використовуючи функцію map отримати список чисел, які були створені в результаті
#   застосування лямбда функції до кожного елемента ітеруємого(мих) об'єкта(ів) який(і) ви можете створити як заманеться.

#   Для перевірки навести 2 тестових приклади у консоль:
# 1 коли передається один список для обробки у map
# 2 коли передається 2 списки чисел для обробки у map

#перша спроба
# f1 = lambda x, y =3: x ** y
# print(f1(4, 3))

# k_map = map(f1, [2, 4, 5, 2, 6, 9])
# k_list =[]
# for i in k_map:
#     k_list.append(i)
#
# l_map = map(f1, [4, 5, 2, 6], [4, 5, 6, 3])
# l_list =[]
# for i in l_map:
#     l_list.append(i)
#
# print(k_list, l_list)

f1 = lambda x, y = 5: x**y

result_map = map(f1, range(0, 8))
print(list(result_map))

result_map2 = map(f1, [3, 4, 5], range(1, 4))
print(list(result_map2))