# Написати функцію яка приймає на вхід параметри: список(або генератор виразу) чисел будь - якої довжини та число.
#
# Функція повинна перевірити чи є у списку 2 числа сума яких еквівалентна числу переданому 2 м параметром.
# Функція має повернути булеве значення як результат пошуку фукції.
#
# Для перевірки викликати двічі функцію з різними тестовими прикладами





def sum_numb (a, b):

    '''Функція перевіряє чи є у списку 2 числа сума яких еквівалентна числу переданому 2м
параметром. Функція повертає булеве значення як результат пошуку фукції.'''

    for x in a:
        if b - x in a:
            # print(True,' = ', x, b - x) таким чином можна побачити перші відповідні значення
            return print(True)
        else:
            return print(False)


sum_numb([3, 6, 11, 20, 8, 11, 10, 13, 4, 9 , 10 ,3, 4, 2, 5, 7 ,8], 13)

sum_numb(list(range(0,15,3)), 23)


# приклад 2
# def list_sum(x:list,y:int):
#     '''Функція перевіряє чи є у списку 2 числа сума яких еквівалентна числу переданому 2м
# параметром. Функція повертає булеве значення як результат пошуку фукції.'''
#     a=[]
#     for m in range(0, len(x)):
#         for i in range(0, len(x)):
#             if m is not i:
#                 a.append(x[m] + x[i])
#     if y in a:
#                 print(True)
#     else:
#                 print(False)
#
# list_sum([0,1,1,1,1], 2)
# list_sum([0,0,-1,0,0,1,2,2,3,55,4,33], 31)
