# Створити функцію що запрошує пароль у користувача. Якщо введено пустий рядок
# або хоч один пробільний символ aбо tab - функція повертає None.
# В усіх інших випадках - функція повертає рядок що введено в терміналі.
#
# Реалізувати декоратор який аналізує що функція повернула рядок у якому присутні
#
# що найменше 1 цифра 1 на буква 1 спеціальний символ і довжина пароля не менше 8 символів,
# пробіл та tab використовувати не дозволяється .
#
# 1.До запуску декоруємої функціі сповіщаються користувачу вимоги до паролю.
# 2.Якщо функція повернула None - потрібно сповістити про те що не приймаються пробільні символи
# і символи табуляції до паролю. Перейти до пункту 1.
# 3.Якщо пароль - відповідає вимогам то декоратор сповіщає що пароль відповідає вимогам
# і повретає з функції перевірений пароль.
# 4.Якщо результат роботи декоруємої функції не відповідає вимогам до паролю то знову повідомити,
# що саме не задовольняє цього разу. Далі повторюються кроки 1 , 2, 3, 4
# до тих пір поки користувач не створе потрібний пароль.

import re

def corect(func):
    def wrapper(*args, **kwargs):
        return_value = func(*args, *kwargs)

        digit_regex = re.compile(r'\d')
        letter_regex = re.compile(r'[a-zA-Zа-яА-Я]')
        special_char_regex = re.compile(r'[!@#$%^&*(),.?":{}|<>]')

        if (digit_regex.search(return_value) and
            letter_regex.search(return_value) and
            special_char_regex.search(return_value) and
            len(return_value) >= 8 and
            not any(char.isspace() for char in return_value)):
            print(f'Ваш новий пароль "\033[91m{return_value}\033[0m" збережено')

        else:
            print('\nВаш пароль не відповідає вимогам!')
            input_password()
    return wrapper



@corect
def input_password(*args, **kwargs):
    print("Введіть пароль, який відповідає наступним вимогам:")
    print("- Мінімум 1 цифра")
    print("- Мінімум 1 буква")
    print("- Мінімум 1 спеціальний символ")
    print("- Довжина пароля не менше 8 символів")
    print("- Відсутність пробільних символів та табуляції")
    password = input('Введіть пароль >>> ')
    return password

input_password()


