# Перевірка пароля:
# У користувача програма запитуює пароль.
# Якщо пароль не відповідає збереженим паролям то відмовити йому у доступі.
# Інакше повідомити користувачу що пароль прийнято.

new_password = input('Ведіть свій новий пароль, він має складатись мінімум з 4х символів  >>>')
if len(new_password) >= 4:
    print('Ваш пароль збережено')

    pasword = input('Повторіть пароль, щоб увійти на сайт  >>>')

    if pasword == new_password:
        print('Пароль прийнято')
    else:
        print('Ваш пароль невірний, вам відмовлено в доступі')
else:
    print('Ваш пароль має бути мінімум 4 символи')


