# N школярів ділять К яблук порівну, остача залишається в корзинці.
# Скільки яблук дістанеться кожому школяру ? Скільки яблук залишиться в корзинці.
# Програма отримує на вхід числа N та K і повинна вивести 2 значення:
#
# 1. Кожному школяру дісталося яблук
# 2. Яблук залишилось в корзинці

pupil = int(input('Введіть кількість школярів >>> '))
apples = int(input('Введіть кількість ябдук >>> '))

print('Кожному школяру дісталося ', apples // pupil, ' яблук')
print(apples % pupil, ' яблук залишилось в корзинці')