# В школі вирішили набрати 3 нових математичинх класи.
# Заняття проходять в один і той самий час, тому виділили 3 різних кабінети.
# За партою може сидіти не більше 2 учнів. Відома кількість учнів в кожному з 3х класів.
# Скільки потрібно закупити парт щоб вистачило на усіх учнів?
# Програма отримує на вхід 3 натуральних числа: кількість учнів у класі.

first_classroom = int(input('кількість учнів в першому класі >>>'))
second_classroom = int(input('кількість учнів у другому класі >>>'))
third_classroom = int(input('кількість учнів у третьому класі >>>'))

# моя перевірка:
# first_classroom = 33
# second_classroom = 20
# third_classroom = 23

first = (first_classroom // 2) + (first_classroom % 2)
second = (second_classroom // 2) + (second_classroom % 2)
third = (third_classroom // 2) + (third_classroom % 2)

print(first, ' парт необіхідно закупити в перший клас')
print(second, ' парт необіхідно закупити в перший клас')
print(third, ' парт необіхідно закупити в перший клас')