# Завдання 2
# Запросити у користувача ввести речення у якому більше 2х слів.
# Розділити речення на список рядків (використовуючи метод рядку  split(" ") - де параметром вказано " ").
# Видалити елементи списку якщо вони містять пусті рядки.
# Відсортирувати рядки у списку.
# Вивести дані зі списку в 2 колонки де перша колонка це індекс писку а 2га колонка це елемент відсортированого списку.
# Вивести кількість слів .

#my_list = "kjnkjn nkjnkjn      fffff" #перевірка

my_list = input("Введіть більше двох слів >>> ")
my_list = my_list.split(' ')
print(f'отриманий список {my_list}')

for x in range(0,my_list.count('')):
    my_list.remove('')
print(f'отриманий список з видаленими пустими рядками - {my_list}')

print(f'Відсортований список - {sorted(my_list)}')

for x in range (0, len(my_list)):
    print(f'{x} - {my_list[x]}')

print(f'Кількість слів у списку - {len(my_list)}')