# Написати функцію сортування двовимірного списку МхМ (матриці) Значення М - задається користувачем з клавіатури.
# Може бути будь-яким цілим, позитивним числом більше 5.
# Функція повинна:
#
# 1. знайти суму елементів стовпців і відсортувати стовпці за
#    зростання цих сум
#
# 2. відсортувати кожен непарний стовпець за зростанням значень знизу
# вгору, а кожен парний стовпець за зростанням значень зверху донизу.
#
# Також ваша програма повинна мати функцію виведення даного списку
# на екрані. При виведенні внизу кожного стовпця повинна виводитися сума елементів цього стовпця.
#
# Що можна використати:
#
# 1. для створення списку використовувати ТІЛЬКИ 'list comprehension' та
# генератор випадкових чисел. Діапазон випадкових чисел для заповнення списку від 1 до 50.
# Список має створюватися записом в один рядок.
#
# 2. Можна використовувати лише два списки. Перший це двомірний список розміром МхМ, другий, допоміжний,
# одномірний список розміром М. Використання інших списків (або колекцій) НЕДОПУСТИМО.
#
# 3. Можна використовувати ТІЛЬКИ ОДНУ змінну М для зберігання розміру списку плюс змінні циклів for.
#
# 4. Для сортування можна використовувати алгоритм бульбашкового сортування.
# Використання вбудованих функцій сортування – НЕДОПУСТИМО (та й не вийде їх використовувати)!
#
# 5. Рішення має включати ТІЛЬКИ ДВІ функції: функцію сортування (за правилами описаними вище)
# та функцію виведення на екран.
#
# Завдання вважається вирішеним правильно за умови дотримання всіх вимог. Охайне виведення на екран – вітається.

import random

number = 6

matrix = [[random.randint(1, 50) for i in range(number)] for n in range(number)]

for x in matrix:
    print(x)

suma = 0
lst_suma = []
k = 0
for elem in range(0, len(matrix)):
        print(matrix[elem][k])
        suma += matrix[elem][k]
        if elem == len(matrix):
            lst_suma.append(suma)



print(suma)
print(lst_suma)