# 2. Дано два списки чисел. Порахуйте, скільки різних чисел міститься як у першому списку, і у другому оночасно.
#    - Примітка. Це завдання на python можна вирішити в один рядок.
# PS: Різних чисел - мається на увазі що усі однакові елементи повинні бути представленні в одному екземплярі
# (приклад: 3 однаковиі числа мають бути пораховані як 1 елемент)

import random

first_list = [random.randint(0,10) for i in range (0, 15)]
second_list = [random.randint(0,10) for i in range (0, 15)]
print(f'У даних двох списках ми маємо {len(set(first_list+second_list))} різних чисел')