# 1. Наведено список чисел (Можна згенерувати числа за допомогою генератора списків).
# Визначте, скільки у ньому зустрічається різних чисел.
# приклад: якщо в списку число 8 зустрічається 3 рази то це означає що в списку зустрічається 8мка.
# - Примітка. Це завдання на python можна вирішити в один рядок.

import random

our_list = [random.randint(0,10) for i in range (0, 20)]

print(f'наш список - {our_list} \nвін має {len(set(our_list))} унікальних чисел')

# вирішення задачі в один рядок
# print(len(set([random.randint(0,10) for i in range (0, 20)])))