# 1 Пишемо кредитний калькулятор:
# Потрібен кредитний калькулятор який може прорахувати виплати які потрібно робити клієнту кожного місяця для погашення всього кредиту.
# Кредит береться клієнтом в уставнові під певний процент - 2% в місяць перші 2 роки та 4% в місяць наступні роки.
# Процент нараховується що місяця на остачу що залишилaся після виплати.
# Програма запитує суму кредиту у клієнта.
# Вивести помісячно суму яку потрібно пратити клєнту щоб розрахуватися з кредитом за 1, за 5 років.
# Очікується що вивід буде оформлений в у вигляді симетрично відофрматованих стовбців.
# Повино бути присутнім у виводі інформаціі - номер місяця, сума виплати за місяць, та скільки процентів нараховано за місяць.

# kredit = int(input('Введіть суму кредити >>>'))
kredit = 50000
platig  = (kredit / 12)
cnt= 0
suma = 0
print('якщо термін вашого кредиту буде 1 рік, ви виплачуватимете:')
for i in range (1,13):
    persent = kredit * 0.02
    cnt += platig + persent
    kredit -= platig
    suma += persent
    print(f'місяць - {i:>2}  сума виплати -  {platig + persent:^7.2f}$ процент - {persent:>7.2f}$ загальна сума виплат = {cnt:^8.2f}$')
print(f'Загальна сума передплати {suma:.2f}$')


kredit = 50000
platig  = (kredit / 60)
cnt = 0
suma = 0
print(' ')
print('Якщо термін вашого кредиту буде 1 рік, ви виплачуватимете:')

for i in range (1,61):
    if i <= 24:
        persent = kredit * 0.02
        kredit -= platig
        cnt += platig + persent
        suma += persent
        print(f'місяць - {i:>2}  сума виплати -  {platig + persent:^7.2f}$ процент - {persent:>7.2f}$ загальна сума виплат = {cnt:^8.2f}$')

    else:
        persent = kredit * 0.04
        kredit -= platig
        cnt += platig + persent
        suma += persent
        print(f'місяць - {i:>2}  сума виплати -  {platig + persent:^7.2f}$ процент - {persent:>7.2f}$ загальна сума виплат = {cnt:^8.2f}$')
print(f'Загальна сума передплати {suma:.2f}$')