# Напишіть функцію використовуючи обробку винятків, яка запитує введення двох значень.
# Якщо хоча б одне з них не є числом, то має виконуватися конкатенація, тобто з'єднання.
# В інших випадках введені числа підсумовуються.


def plus(*args, **kwargs):

    '''функція робить суму двох чисел
    або конкатинацію числа і рядка'''

    a = input('enter your number >>> ')
    b = input('enter your second number >>> ')
    try:
        d = int(a) + int(b)
    except ValueError:
        d = a + b
    print(d)


plus()