# 1.
#
# Написати програму, яка запитує у користувача два слова через пробіл.
# Визначити що введено саме 2 слова - якщо ні то запросити ввести те, що потрібно ще раз.
# Програма друкує слова в порядку прямування, але вони повинні бути перевернуті і кожне слово повинно починатися з великого символу,
# а всі інші були приведені до нижнього регістру.
#
# Наприклад:
#     “My Bag’
# Результат:
#     “Ym Gab”


while True:
    input_words = input("Введіть більше 2х слів >>>")
    if ' ' in input_words:
        print(input_words)
        print(input_words[::-1].title())
        break
    else:
        continue

