# 4.
#
# Дано рядок (отримати рядок з терміналу від користувача ). Домовимось рядок більше 15 символів.
#   a. виведіть третій символ цього рядка.
#   b. виведіть передостанній символ цього рядка.
#   c. виведіть перші п'ять символів цього рядка.
#   d. виведіть весь рядок, крім двох останніх символів.
#   e. виведіть усі символи з парними індексами (вважаючи, що індексація починається з 0, тому символи виводяться починаючи)
#   з першого).
#   f. виведіть усі символи з непарними індексами, тобто, починаючи з другого символу рядка.
#   g. виведіть усі символи у зворотному порядку.
#   h. виведіть усі символи рядка через один у зворотному порядку, починаючи з останнього.
#   i. виведіть довжину цього рядка.

while True:
        input_str = input("Введіть рядок більше 15 символів >>>")
        number =len(input_str)

        if len(input_str) > 15:
                print('третій символ цього рядка >>> ', input_str[2])
                print('передостанній символ цього рядка >>> ', input_str[-2])
                print('перші п\'ять символів цього рядка >>> ', input_str[0:5])
                print('''усі символи з парними індексами (вважаючи, що індексація починається з 0, тому символи виводяться починаючи)
                   з першого >>> ''', input_str[::2])
                print('усі символи з непарними індексами, тобто, починаючи з другого символу рядка >>> ', input_str[1:number:2])
                print('усі символи у зворотному порядку >>> ', input_str[::-1])
                print('усі символи рядка через один у зворотному порядку, починаючи з останнього >>> ', input_str[number:0:-2])
                print('виведіть довжину цього рядка >>> ', len(input_str))
        else:
                print("Рядок має бути більше 15 символів")


