# Документ "article.txt" містить наступний текст:
#
# "Вечоріло
# Гуділи мухи
# Світив ліхтарик
# Кипіла вода в чайнику
# Венера спалахнула на небі
# Дерева шуміли
# Хмари розійшлися
# Листя зеленіло"
#
#   Потрібно реалізувати функцію longest_words(file), яка виводить слово, що має максимальну довжину (або список слів, якщо таких кілька).
#
# Так як додаткові символи показувати нам не потрібно (перенесення рядків),
#   Виводити їх на друк не потрібно.


def longest_words(our_file):


    '''функція приймає текстовий файл і друкує з нього найдовші слова'''


    # відкриваємо файл на читання
    file = open(our_file, 'r')

    #створюємо змінну з текстом
    our_text = file.read()

    #перетвоює слова з тексту у список
    words = our_text.split()

    #шукаємо найдовше слово списку
    max_word = max(len(word) for word in words)

    #друкуємо список з найдовшими словами
    our_list = [i for i in words if len(i) == max_word]
    return our_list



our_file = 'article.txt'
result = longest_words(our_file)
print(result)

